## Plan Result (sandbox_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 10 to change, 14 to destroy.</code></pre>

* Update
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_token
* Replace
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["demo"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/5c44f162-336a-4ea9-bb48-97cc24cc9009" -> (known after apply)
      ~ application_object_id = "5c44f162-336a-4ea9-bb48-97cc24cc9009" -> "/applications/5c44f162-336a-4ea9-bb48-97cc24cc9009" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "5c44f162-336a-4ea9-bb48-97cc24cc9009/password/64bf2f9d-b680-473d-89fc-e9c5505281e5" -> (known after apply)
      ~ key_id                = "64bf2f9d-b680-473d-89fc-e9c5505281e5" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["dev"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/2c3af9a6-3672-4333-8c94-56968d3d6aa8" -> (known after apply)
      ~ application_object_id = "2c3af9a6-3672-4333-8c94-56968d3d6aa8" -> "/applications/2c3af9a6-3672-4333-8c94-56968d3d6aa8" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "2c3af9a6-3672-4333-8c94-56968d3d6aa8/password/42ba0868-1f3b-4a6a-bf71-926e9653d1b6" -> (known after apply)
      ~ key_id                = "42ba0868-1f3b-4a6a-bf71-926e9653d1b6" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ithc"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/2186fd08-2cf8-4925-868b-e73614b2c9e2" -> (known after apply)
      ~ application_object_id = "2186fd08-2cf8-4925-868b-e73614b2c9e2" -> "/applications/2186fd08-2cf8-4925-868b-e73614b2c9e2" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "2186fd08-2cf8-4925-868b-e73614b2c9e2/password/1d28133f-f1c9-4282-ac15-8e6022e566ae" -> (known after apply)
      ~ key_id                = "1d28133f-f1c9-4282-ac15-8e6022e566ae" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["prod"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/fe3b994d-abac-48ed-a052-4a51aad3488d" -> (known after apply)
      ~ application_object_id = "fe3b994d-abac-48ed-a052-4a51aad3488d" -> "/applications/fe3b994d-abac-48ed-a052-4a51aad3488d" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "fe3b994d-abac-48ed-a052-4a51aad3488d/password/813702de-4a4a-4a40-9e25-20e7bb56d3c2" -> (known after apply)
      ~ key_id                = "813702de-4a4a-4a40-9e25-20e7bb56d3c2" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptl"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/9523289a-b8c9-4cc3-a779-fdba4dc02b36" -> (known after apply)
      ~ application_object_id = "9523289a-b8c9-4cc3-a779-fdba4dc02b36" -> "/applications/9523289a-b8c9-4cc3-a779-fdba4dc02b36" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "9523289a-b8c9-4cc3-a779-fdba4dc02b36/password/a31d66c7-9772-43fa-804a-49a775550082" -> (known after apply)
      ~ key_id                = "a31d66c7-9772-43fa-804a-49a775550082" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["ptlsbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/b5727657-40c4-4910-98a0-6f16e89ddd38" -> (known after apply)
      ~ application_object_id = "b5727657-40c4-4910-98a0-6f16e89ddd38" -> "/applications/b5727657-40c4-4910-98a0-6f16e89ddd38" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "b5727657-40c4-4910-98a0-6f16e89ddd38/password/f1b5d1ef-fcc7-4945-83ca-f2629571a73b" -> (known after apply)
      ~ key_id                = "f1b5d1ef-fcc7-4945-83ca-f2629571a73b" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["sbox"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/6d7f878d-f63c-4cb5-8388-907dff14abab" -> (known after apply)
      ~ application_object_id = "6d7f878d-f63c-4cb5-8388-907dff14abab" -> "/applications/6d7f878d-f63c-4cb5-8388-907dff14abab" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "6d7f878d-f63c-4cb5-8388-907dff14abab/password/a569a7c5-1237-4823-ab5f-1635a39d2d18" -> (known after apply)
      ~ key_id                = "a569a7c5-1237-4823-ab5f-1635a39d2d18" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["stg"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/1d518743-e32c-4908-8dbb-8629d107a7b9" -> (known after apply)
      ~ application_object_id = "1d518743-e32c-4908-8dbb-8629d107a7b9" -> "/applications/1d518743-e32c-4908-8dbb-8629d107a7b9" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "1d518743-e32c-4908-8dbb-8629d107a7b9/password/554690eb-8472-40e1-bc7c-b808d92ff79d" -> (known after apply)
      ~ key_id                = "554690eb-8472-40e1-bc7c-b808d92ff79d" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.environment["test"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/aa4f804b-b9b0-4e6a-b6f5-d58718d49b42" -> (known after apply)
      ~ application_object_id = "aa4f804b-b9b0-4e6a-b6f5-d58718d49b42" -> "/applications/aa4f804b-b9b0-4e6a-b6f5-d58718d49b42" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-09-15T07:03:21Z" -> (known after apply)
      ~ id                    = "aa4f804b-b9b0-4e6a-b6f5-d58718d49b42/password/ff9707ed-7937-4915-b239-f0b31ce4a3ac" -> (known after apply)
      ~ key_id                = "ff9707ed-7937-4915-b239-f0b31ce4a3ac" -> (known after apply)
      ~ start_date            = "2023-09-15T07:03:21Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/b944faf8-0645-41db-a4e2-0a6e8a10e207" -> (known after apply)
      ~ application_object_id = "b944faf8-0645-41db-a4e2-0a6e8a10e207" -> "/applications/b944faf8-0645-41db-a4e2-0a6e8a10e207" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:04:57Z" -> (known after apply)
      ~ id                    = "b944faf8-0645-41db-a4e2-0a6e8a10e207/password/ded70f0b-f38b-455c-bc35-e6761db988e1" -> (known after apply)
      ~ key_id                = "ded70f0b-f38b-455c-bc35-e6761db988e1" -> (known after apply)
      ~ start_date            = "2023-07-25T07:04:57Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "7193b08a-adb7-4577-9313-1de42bb9db7f"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c06069648f3a1ed8e38bckv.vault.azure.net/secrets/sp-token/9d2411b0315844e5bf402601a97ca475"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DTS-RBAC-SBOX"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/dd126085-0aca-49c0-858d-b54dc1756fd7" -> (known after apply)
      ~ application_object_id = "dd126085-0aca-49c0-858d-b54dc1756fd7" -> "/applications/dd126085-0aca-49c0-858d-b54dc1756fd7" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:04:57Z" -> (known after apply)
      ~ id                    = "dd126085-0aca-49c0-858d-b54dc1756fd7/password/2b8d3541-bc2c-4b42-ae21-ce6bd5482257" -> (known after apply)
      ~ key_id                = "2b8d3541-bc2c-4b42-ae21-ce6bd5482257" -> (known after apply)
      ~ start_date            = "2023-07-25T07:04:57Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-RBAC-SBOX"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "ffda949d-2085-4d7e-8f27-2e958796228f"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cefd1f8125b0577156ff9kv.vault.azure.net/secrets/sp-token/0c4b75dddb18432384b9ded7fd7f773a"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/2ab006be-b701-457e-8f3b-f707193a77fe" -> (known after apply)
      ~ application_object_id = "2ab006be-b701-457e-8f3b-f707193a77fe" -> "/applications/2ab006be-b701-457e-8f3b-f707193a77fe" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:04:57Z" -> (known after apply)
      ~ id                    = "2ab006be-b701-457e-8f3b-f707193a77fe/password/207c56b6-0a11-4e16-91a0-230f7f0b2dc2" -> (known after apply)
      ~ key_id                = "207c56b6-0a11-4e16-91a0-230f7f0b2dc2" -> (known after apply)
      ~ start_date            = "2023-07-25T07:04:57Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "ee5fcaa6-260c-4488-8a71-1e56a3e6a2d3"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c6d1e076a04063e28a488kv.vault.azure.net/secrets/sp-token/fffae58308fd462c9d956b90718484f1"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/f64f5da2-f411-47a5-b660-38242d509577" -> (known after apply)
      ~ application_object_id = "f64f5da2-f411-47a5-b660-38242d509577" -> "/applications/f64f5da2-f411-47a5-b660-38242d509577" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:04:57Z" -> (known after apply)
      ~ id                    = "f64f5da2-f411-47a5-b660-38242d509577/password/179af706-6a7d-4ffe-bd75-0c869575e53e" -> (known after apply)
      ~ key_id                = "179af706-6a7d-4ffe-bd75-0c869575e53e" -> (known after apply)
      ~ start_date            = "2023-07-25T07:04:57Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "b1e3e58e-9b96-42e4-8a89-7c91b00ceb31"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c173a0e9679e4abc83ab0kv.vault.azure.net/secrets/sp-token/4163a4e08e38497eabe63be1f47376b7"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      ~ application_id        = "/applications/82b844de-a0d0-469d-89f0-d6b5ec482480" -> (known after apply)
      ~ application_object_id = "82b844de-a0d0-469d-89f0-d6b5ec482480" -> "/applications/82b844de-a0d0-469d-89f0-d6b5ec482480" # forces replacement
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-25T07:04:57Z" -> (known after apply)
      ~ id                    = "82b844de-a0d0-469d-89f0-d6b5ec482480/password/2e00fd77-1eb1-406c-b12a-36e807549b6c" -> (known after apply)
      ~ key_id                = "2e00fd77-1eb1-406c-b12a-36e807549b6c" -> (known after apply)
      ~ start_date            = "2023-07-25T07:04:57Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "1e06f637-8465-4d7b-8a8c-4d3a69799251"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://cbb9ca405cdfab539e8b3kv.vault.azure.net/secrets/sp-token/cd5da04be3774e82bb435dffe3dffcc1"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

Plan: 14 to add, 10 to change, 14 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":99,"Program":"tfcmt","SHA1":"","Target":"sandbox_enterprise","Vars":{}} -->